[
  {
    "id": 1,
    "text": "Explore This SectionEarthEarth ObserverEditor's CornerFeature ArticlesMeeting SummariesNewsScience in the NewsCalendarsIn MemoriamAnnouncementsMoreArchivesConference SchedulesStyle Guide9 min readHarmonized Landsat and Sentinel-2: Collaboration Drives InnovationEarth Observer StaffAug 25, 2025ArticleIntroductionLandsat, a joint program of NASA and the U.S. Geological Survey (USGS), has been an invaluable tool for monitoring changes in Earth’s land surface for over 50 years. Researchers use instruments on Landsat satellites to monitor decades-long trends, including urbanization and agricultural expansion, as well as short-term dynamics, including water use and disaster recovery. However, scientists and land managers often encounter one critical limitation of this program: Landsat has a revisit time of eight days (with Landsat 8 and 9 operating), which is too long to capture events and disasters that occur on short timescales. Floods, for example, can quickly inundate a region, and cloud cover from storms can delay Landsat’s ability to get a clear observation on damage.In 2015, the European Space Agency’s (ESA) CopernicusSentinel-2Amission joined Landsat 7 and 8 in orbit. It was designed to collect comparable optical land data with the intention of leveraging Landsat’s archive. Two years later, ESA launched Sentinel-2B, a satellite identical to Sentinel-2A.Led by a science team at NASA’s Goddard Space Flight Center (GSFC), the USGS, NASA, and ESA began to work on combining the capabilities of Sentinel-2 and Landsat satellites. This idea was the impetus behindHarmonized Landsat and Sentinel-2(HLS) project, a NASA initiative that created a seamless product from theOperational Land Imager(OLI) andMulti-Spectral Instrument(MSI) aboard Landsat and Sentinel-2 satellites, respectively. HLS Version 2.0 (V2.0) is the most recent version of these data and had a global median repeat frequency of 1.6 days in 2022 by combining observations from Landsat 8 and 9 and Sentinel-2A and B. The recent addition of Sentinel-2C data will provide even more frequent observations. With near-global coverage and improved harmonization algorithms, HLS V2.0 paves the way for new applications and improved land monitoring systems – seeAnimation 1. HLS data are available for download on NASA Earthdata:HLSL30v2.0andHLSS30v2.0. These data can also be accessed through Google Earth Engine:HLSL30v2.0and HLSS30v2.0.Animation 1. This visualization shows the change in vegetation in Maryland from January 1 to December 30, 2016, using Normalized Difference Vegetation Index (NDVI) data from Harmonized Landsat Sentinel-2 (HLS). The visualization shows land on both sides of the Chesapeake Bay, where red represents bare soil and green indicates healthy, growing vegetation.Animation credit: Michael Taylor [Science Systems and Applications Inc. (SSAI)], Matthew Radcliff [USRA], and Jeffrey Masek [GSFC]. Caption adapted from Laura Rocchio [SSAI]The Dawn of HLSThe story of HLS begins before the launch of Sentinel-2A in 2015.Jeffrey Masek[GSFC], who was at that time project scientist for Landsat 8, led a group of researchers who wanted to find a way to harmonize Landsat data with other satellite data. Their aim was to create a “virtual constellation” similar to how weather satellites operate.“HLS meets a need that people have been asking for for a long time,” said Masek.What began as a research question with an experimental product evolved into an operational project with the involvement of theSatellite Needs Working Group(SNWG). SNWG is an interagency effort to develop solutions that address Earth observation needs of civilian federal agencies. Every two years, SNWG conducts a survey of federal agencies to see how their work could benefit from satellite data. The answers span the gamut of application areas, from water quality monitoring to disaster recovery to planning how best to protect and use natural resources. SNWG brings these ideas to NASA, USGS, and the National Oceanic and Atmospheric Administration (NOAA) – the three main U.S. government providers of satellite data. These agencies work together to create and implement solutions that serve those needs. NASA plays a critical role in every step of the SNWG process, including leading the assessment of survey responses from over 30 federal agencies, managing and supporting the implementation of identified solutions, and encouraging solution co-design with federal partners to maximize impact.TheHLS surface reflectance productwas an outcome of the very first SNWG solution cycle in 2016. This product was expanded, following additional SNWG requests in 2020 and 2022. The 2020 cycle saw the creation of nineHLS-derived vegetation indices, and the 2022 cycle aimed for a six-hour latency product.The U.S. Department of Agriculture (USDA) now uses HLS tomap crop emergenceat the field scale in the corn belt, allowing farmers to better plan their growing seasons. Ranchers in Colorado use the dataset to decide where to graze their cattle during periods of drought. HLS alsoinforms the use and termination of cover crops in the Chesapeake Bay area. In 2024, the Federal Emergency Management Agency (FEMA) employed HLS toidentify where to focus aid in the aftermath of Hurricane Helene.A New and Improved HLSIn the July 2025 issue ofRemote Sensing of Environment, a team of researchers outlined the HLS V2.0 surface reflectance dataset and algorithms. The team included seven NASA co-authors, members of the2018–2023 Landsat Science Team, and ESA. The lead author,Junchang Ju[GSFC—Remote Sensing Scientist], has been the technical lead on HLS since its inception. Co-authorChristopher Neigh[GSFC—Landsat 8/9 Project Scientist] is the principal investigator on the HLS project. V2.0, which was completed in Summer 2023, incorporates several major improvements over HLS V1.4, the most recent publicly available HLS product. The HLS production team at NASA’s Marshall Space Flight Center (MSFC), led byMadhu Sridhar[University of Alabama in Huntsville—Research Scientist], ensures consistent data access through close collaboration with ESA and the Land Processes Distributed Active Archive Center (LP DAAC). HLS V1.4 covered about 30% of the global land area, providing data on North America and other select locations. HLS V2.0 provides data at a spatial resolution of 30 m (98 ft) with near-global coverage from 2013 onward. The dataset includes all land masses except Antarctica. HLS V2.0 also has key algorithmic improvements in atmospheric correction, cloud masking, and bidirectional reflectance distribution function (BRDF) correction. Together, these algorithms “harmonize” the data, or ensure that the distinct Landsat and Sentinel-2 datasets can effectively be used interchangeably – seeAnimation 2.Animation 2: The visualization provides the Normalized Difference Vegetation Index (NDVI) data from Harmonized Landsat Sentinel-2 (HLS) for farm fields south of Columbus, NE. The red represents bare soil and green represents healthy, growing vegetation. The animation runs from January 1 to December 30, 2016.Animation credit: Michael Taylor [SSAI], Matthew Radcliff [USRA], and Jeffrey Masek [GSFC]. Caption adapted from Laura Rocchio [SSAI]HLS V2.0 in ActionThe increased frequency of observations improved the ability of the scientific community to track disaster recovery, changes in phenology, agricultural intensification, rapid urban growth, logging, and deforestation. Researchers are already putting these advances to use.The land disturbance product(DIST-ALERT) is a global land change monitoring system that uses HLS V2.0 data to track vegetation anomalies in near real-time – seeFigure 1. DIST-ALERT captures agricultural expansion, urban growth, fire, flooding, logging, drought, landslides, and other forces of change to vegetation.Amy Pickens[University of Maryland, Department of Geographical Sciences—Assistant Research Professor] said that HLS is the perfect dataset for tracking disturbances because of the frequency of observations.DIST-ALERT was created throughObservational Products for End-Users from Remote Sensing Analysis(OPERA), a project at NASA/Jet Propulsion Laboratory (JPL). OPERA products respond to agency needs identified by the SNWG. In 2018, SNWG identified tracking surface disturbance as a key need. OPERA partnered with theGlobal Land Analysis and Discovery(GLAD) lab at University of Maryland to develop the change detection algorithm.To track changes in vegetation, the DIST-ALERT system establishes arolling baseline– meaning that for any given pixel, the vegetation cover is compared against vegetation cover from the same 31-day window in the previous three years. The primary algorithm detects any vegetation loss relative to the established baseline. A secondary algorithm flags anyspectral anomaly(i.e., any change in reflectance) compared to that same baseline. This approach ensures that the algorithm catches non-vegetation change (e.g., new building or road projects in unvegetated areas). Used together, these algorithms can identify long-term changes in agricultural expansion, deforestation, and urbanization alongside short-term changes in crop harvest, drought, selective logging, and the impacts of disasters. On average, DIST-ALERT is made available on LP DAAC within six hours of when new HLS data is available. Currently, the dataset does not provide attribution to disturbances.Figure 1.In March 2025, wildfires burned through South Korea, resulting in heavy vegetation loss. [left] Output of the DIST-ALERT product on NASAWorldviewfrom May 8, 2025, with vegetation loss in percent flagged with varying levels of confidence. Yellow and red represent areas with confirmed vegetation cover losses of <50% and ≥50%, respectively. [right] Natural-color image captured by the Multi-Spectral Instrument (MSI) aboard Sentinel-2C on May 8, 2025. The large brown burn scar in the center of the image corresponds to vegetation loss detected by DIST-ALERT. It stands in contrast to the surrounding green vegetation.Figure credit: NASA EarthdataDisturbance alerts already exist in some ecosystems. Brazil’s National Institute for Space Research [Instituto Nacional de Pesquisas Espaciais (INPE)] runs two projects that detect deforestation in the Amazon: Programa de Cálculo do Desflorestamento da Amazônia (PRODES) andSistema de Detecção de Desmatamento em Tempo Real(DETER). The GLAD lab created its own forest loss alerts – GLAD-L and GLAD-S2 – using Landsat and Sentinel-2 data respectively.Global Forest Watchintegrates GLAD-L and GLAD-S2 data with Radar for Detecting Deforestation (RADD) observations – derived from synthetic aperture radar data from Copernicus Sentinel-1 – into an integrated deforestation alert.The implementation of these alert systems, some of which have been around for decades, have been shown to impact deforestation rates in the tropics. For example, a 2021 study inNature Climate Changefound that deforestation alerts decreased the probability of deforestation in Central Africa by 18% relative to the average 2011–2016 levels.DIST-ALERT is distinct from other alert systems in a few ways. First, it has global coverage. Second, the rolling baseline allows for tracking changes in seasonality and disturbances to dynamic ecosystems. When  HLS V2.0 data are input to DIST-ALERT, the system is also better at identifying disturbances in cloudy ecosystems than other individual alert systems – because it is more likely to obtain clear observations. This also enables it to identify the start and end of the disturbance more precisely.Pickens said that the DIST-ALERT team is already working with end-users who are implementing their data product. She has spoken to some who use the system to help logging companies prove that they are complying with regulations. The U.S. Census Bureau is also using DIST-ALERT to monitor fast-growing communities so that they can do targeted assessments in the interim between the larger decennial census.Alongside DIST-ALERT, OPERA has also been developing theDynamic Surface Water eXtent(DSWx) product suite, which employs HLS to track surface water (e.g., lakes, reservoirs, rivers, and floods) around the globe – seeFigure 2. These new products represent the new applications made possible by the HLS interagency and international collaboration.Figure 2. The map shows flood extent and estimates of flood depth in areas west of Porto Alegre, Brazil on May 6, 2024. The flood extent is from the Observational Products for End-Users from Remote Sensing Analysis (OPERA) Dynamic Surface Water eXtent product, which uses Harmonized Landsat Sentinel-2 data. The flood depth estimate is from theFloodwater Depth Estimation Tool(FwD ET). The darkest blue areas represent floodwater at least 5 m (20 ft) deep. Much of the inundated floodplain is light blue, which equates to depths of between 0.1–1 m (4–40 in).Figure credit: Lauren Dauphin [NASA’s Earth Observatory], Dinuke Munasinghe [JPL], Sagy Cohen [University of Alabama], and Alexander Handwerger [JPL]ConclusionHLS is set to continue improving land monitoring efforts across the globe. Meanwhile, the HLS science team is working to improve the algorithms for a more seamless harmonization of Landsat 8 and 9 and Sentinel-2 data. They are also working to improve the cloud-masking algorithm, have recently released vegetation indices, and are working on developing a low-latency (six-hour) HLS surface reflectance product, all while incorporating user feedback.Looking ahead, the launch of future Sentinel and Landsat satellites will further the development of HLS. The additional data and unique capabilities will continue to meet researchers’ need for more frequent, high-quality satellite observations of Earth’s land surface.Madeleine GregoryNASA’s Goddard Space Flight Center/Science Systems and Applications Inc.madeleine.s.gregory@nasa.govShareDetailsLast UpdatedAug 26, 2025Related TermsEarth Science"
  },
  {
    "id": 2,
    "text": "Landsat, a joint program of NASA and the U.S. Geological Survey (USGS), has been an invaluable tool for monitoring changes in Earth’s land surface for over 50 years. Researchers use instruments on Landsat satellites to monitor decades-long trends, including urbanization and agricultural expansion, as well as short-term dynamics, including water use and disaster recovery. However, scientists and land managers often encounter one critical limitation of this program: Landsat has a revisit time of eight days (with Landsat 8 and 9 operating), which is too long to capture events and disasters that occur on short timescales. Floods, for example, can quickly inundate a region, and cloud cover from storms can delay Landsat’s ability to get a clear observation on damage."
  },
  {
    "id": 3,
    "text": "In 2015, the European Space Agency’s (ESA) CopernicusSentinel-2Amission joined Landsat 7 and 8 in orbit. It was designed to collect comparable optical land data with the intention of leveraging Landsat’s archive. Two years later, ESA launched Sentinel-2B, a satellite identical to Sentinel-2A."
  },
  {
    "id": 4,
    "text": "Led by a science team at NASA’s Goddard Space Flight Center (GSFC), the USGS, NASA, and ESA began to work on combining the capabilities of Sentinel-2 and Landsat satellites. This idea was the impetus behindHarmonized Landsat and Sentinel-2(HLS) project, a NASA initiative that created a seamless product from theOperational Land Imager(OLI) andMulti-Spectral Instrument(MSI) aboard Landsat and Sentinel-2 satellites, respectively. HLS Version 2.0 (V2.0) is the most recent version of these data and had a global median repeat frequency of 1.6 days in 2022 by combining observations from Landsat 8 and 9 and Sentinel-2A and B. The recent addition of Sentinel-2C data will provide even more frequent observations. With near-global coverage and improved harmonization algorithms, HLS V2.0 paves the way for new applications and improved land monitoring systems – seeAnimation 1. HLS data are available for download on NASA Earthdata:HLSL30v2.0andHLSS30v2.0. These data can also be accessed through Google Earth Engine:HLSL30v2.0and HLSS30v2.0."
  },
  {
    "id": 5,
    "text": "The story of HLS begins before the launch of Sentinel-2A in 2015.Jeffrey Masek[GSFC], who was at that time project scientist for Landsat 8, led a group of researchers who wanted to find a way to harmonize Landsat data with other satellite data. Their aim was to create a “virtual constellation” similar to how weather satellites operate."
  },
  {
    "id": 6,
    "text": "“HLS meets a need that people have been asking for for a long time,” said Masek."
  },
  {
    "id": 7,
    "text": "What began as a research question with an experimental product evolved into an operational project with the involvement of theSatellite Needs Working Group(SNWG). SNWG is an interagency effort to develop solutions that address Earth observation needs of civilian federal agencies. Every two years, SNWG conducts a survey of federal agencies to see how their work could benefit from satellite data. The answers span the gamut of application areas, from water quality monitoring to disaster recovery to planning how best to protect and use natural resources. SNWG brings these ideas to NASA, USGS, and the National Oceanic and Atmospheric Administration (NOAA) – the three main U.S. government providers of satellite data. These agencies work together to create and implement solutions that serve those needs. NASA plays a critical role in every step of the SNWG process, including leading the assessment of survey responses from over 30 federal agencies, managing and supporting the implementation of identified solutions, and encouraging solution co-design with federal partners to maximize impact."
  },
  {
    "id": 8,
    "text": "TheHLS surface reflectance productwas an outcome of the very first SNWG solution cycle in 2016. This product was expanded, following additional SNWG requests in 2020 and 2022. The 2020 cycle saw the creation of nineHLS-derived vegetation indices, and the 2022 cycle aimed for a six-hour latency product."
  },
  {
    "id": 9,
    "text": "The U.S. Department of Agriculture (USDA) now uses HLS tomap crop emergenceat the field scale in the corn belt, allowing farmers to better plan their growing seasons. Ranchers in Colorado use the dataset to decide where to graze their cattle during periods of drought. HLS alsoinforms the use and termination of cover crops in the Chesapeake Bay area. In 2024, the Federal Emergency Management Agency (FEMA) employed HLS toidentify where to focus aid in the aftermath of Hurricane Helene."
  },
  {
    "id": 10,
    "text": "In the July 2025 issue ofRemote Sensing of Environment, a team of researchers outlined the HLS V2.0 surface reflectance dataset and algorithms. The team included seven NASA co-authors, members of the2018–2023 Landsat Science Team, and ESA. The lead author,Junchang Ju[GSFC—Remote Sensing Scientist], has been the technical lead on HLS since its inception. Co-authorChristopher Neigh[GSFC—Landsat 8/9 Project Scientist] is the principal investigator on the HLS project. V2.0, which was completed in Summer 2023, incorporates several major improvements over HLS V1.4, the most recent publicly available HLS product. The HLS production team at NASA’s Marshall Space Flight Center (MSFC), led byMadhu Sridhar[University of Alabama in Huntsville—Research Scientist], ensures consistent data access through close collaboration with ESA and the Land Processes Distributed Active Archive Center (LP DAAC). HLS V1.4 covered about 30% of the global land area, providing data on North America and other select locations. HLS V2.0 provides data at a spatial resolution of 30 m (98 ft) with near-global coverage from 2013 onward. The dataset includes all land masses except Antarctica. HLS V2.0 also has key algorithmic improvements in atmospheric correction, cloud masking, and bidirectional reflectance distribution function (BRDF) correction. Together, these algorithms “harmonize” the data, or ensure that the distinct Landsat and Sentinel-2 datasets can effectively be used interchangeably – seeAnimation 2."
  },
  {
    "id": 11,
    "text": "The increased frequency of observations improved the ability of the scientific community to track disaster recovery, changes in phenology, agricultural intensification, rapid urban growth, logging, and deforestation. Researchers are already putting these advances to use."
  },
  {
    "id": 12,
    "text": "The land disturbance product(DIST-ALERT) is a global land change monitoring system that uses HLS V2.0 data to track vegetation anomalies in near real-time – seeFigure 1. DIST-ALERT captures agricultural expansion, urban growth, fire, flooding, logging, drought, landslides, and other forces of change to vegetation.Amy Pickens[University of Maryland, Department of Geographical Sciences—Assistant Research Professor] said that HLS is the perfect dataset for tracking disturbances because of the frequency of observations."
  },
  {
    "id": 13,
    "text": "DIST-ALERT was created throughObservational Products for End-Users from Remote Sensing Analysis(OPERA), a project at NASA/Jet Propulsion Laboratory (JPL). OPERA products respond to agency needs identified by the SNWG. In 2018, SNWG identified tracking surface disturbance as a key need. OPERA partnered with theGlobal Land Analysis and Discovery(GLAD) lab at University of Maryland to develop the change detection algorithm."
  },
  {
    "id": 14,
    "text": "To track changes in vegetation, the DIST-ALERT system establishes arolling baseline– meaning that for any given pixel, the vegetation cover is compared against vegetation cover from the same 31-day window in the previous three years. The primary algorithm detects any vegetation loss relative to the established baseline. A secondary algorithm flags anyspectral anomaly(i.e., any change in reflectance) compared to that same baseline. This approach ensures that the algorithm catches non-vegetation change (e.g., new building or road projects in unvegetated areas). Used together, these algorithms can identify long-term changes in agricultural expansion, deforestation, and urbanization alongside short-term changes in crop harvest, drought, selective logging, and the impacts of disasters. On average, DIST-ALERT is made available on LP DAAC within six hours of when new HLS data is available. Currently, the dataset does not provide attribution to disturbances."
  },
  {
    "id": 15,
    "text": "Disturbance alerts already exist in some ecosystems. Brazil’s National Institute for Space Research [Instituto Nacional de Pesquisas Espaciais (INPE)] runs two projects that detect deforestation in the Amazon: Programa de Cálculo do Desflorestamento da Amazônia (PRODES) andSistema de Detecção de Desmatamento em Tempo Real(DETER). The GLAD lab created its own forest loss alerts – GLAD-L and GLAD-S2 – using Landsat and Sentinel-2 data respectively.Global Forest Watchintegrates GLAD-L and GLAD-S2 data with Radar for Detecting Deforestation (RADD) observations – derived from synthetic aperture radar data from Copernicus Sentinel-1 – into an integrated deforestation alert."
  },
  {
    "id": 16,
    "text": "The implementation of these alert systems, some of which have been around for decades, have been shown to impact deforestation rates in the tropics. For example, a 2021 study inNature Climate Changefound that deforestation alerts decreased the probability of deforestation in Central Africa by 18% relative to the average 2011–2016 levels."
  },
  {
    "id": 17,
    "text": "DIST-ALERT is distinct from other alert systems in a few ways. First, it has global coverage. Second, the rolling baseline allows for tracking changes in seasonality and disturbances to dynamic ecosystems. When  HLS V2.0 data are input to DIST-ALERT, the system is also better at identifying disturbances in cloudy ecosystems than other individual alert systems – because it is more likely to obtain clear observations. This also enables it to identify the start and end of the disturbance more precisely."
  },
  {
    "id": 18,
    "text": "Pickens said that the DIST-ALERT team is already working with end-users who are implementing their data product. She has spoken to some who use the system to help logging companies prove that they are complying with regulations. The U.S. Census Bureau is also using DIST-ALERT to monitor fast-growing communities so that they can do targeted assessments in the interim between the larger decennial census."
  },
  {
    "id": 19,
    "text": "Alongside DIST-ALERT, OPERA has also been developing theDynamic Surface Water eXtent(DSWx) product suite, which employs HLS to track surface water (e.g., lakes, reservoirs, rivers, and floods) around the globe – seeFigure 2. These new products represent the new applications made possible by the HLS interagency and international collaboration."
  },
  {
    "id": 20,
    "text": "HLS is set to continue improving land monitoring efforts across the globe. Meanwhile, the HLS science team is working to improve the algorithms for a more seamless harmonization of Landsat 8 and 9 and Sentinel-2 data. They are also working to improve the cloud-masking algorithm, have recently released vegetation indices, and are working on developing a low-latency (six-hour) HLS surface reflectance product, all while incorporating user feedback."
  },
  {
    "id": 21,
    "text": "Looking ahead, the launch of future Sentinel and Landsat satellites will further the development of HLS. The additional data and unique capabilities will continue to meet researchers’ need for more frequent, high-quality satellite observations of Earth’s land surface."
  },
  {
    "id": 22,
    "text": "Madeleine GregoryNASA’s Goddard Space Flight Center/Science Systems and Applications Inc.madeleine.s.gregory@nasa.gov"
  },
  {
    "id": 23,
    "text": "NASA explores the unknown in air and space, innovates for the benefit of humanity, and inspires the world through discovery."
  }
]