[
  {
    "id": 1,
    "text": "Vanessa ThomasSeptember 22, 2025CategoriesEscaPADE (Escape and Plasma Acceleration and Dynamics Explorers)Goddard Space Flight CenterHeliophysicsHeliophysics DivisionMarsSolar WindSpace WeatherThe SunNASA’s ESCAPADE Spacecraft Return to Florida to Prepare for LaunchNASA’s twin ESCAPADE (Escape and Plasma Acceleration and Dynamics Explorers) spacecraft are back in Florida in preparation for launch this fall.The two spacecraft are destined to orbit Mars, where they will study the structure of the Martian magnetic field, how it interacts with space weather, and how this interaction drives the planet’s atmospheric escape. The information gained from the ESCAPADE spacecraft will enable us to better protect future human and robotic missions to the Red Planet.NASA’s two ESCAPADE spacecraft appear inside a clean room at the Astrotech Space Operations Facility in Titusville, Florida, in September 2025.Rocket LabThe ESCAPADE spacecraft arrived at the Astrotech Space Operations Facility in Titusville, Florida, on Sept. 16 from Rocket Lab’s Spacecraft Production Complex and headquarters in Long Beach, California, where it was designed, built, and tested.The spacecraft werepreviously in Floridain 2024, but had returned to California afterNASA decided to stand downfrom a launch attempt last year.Before propellant loading and vehicle integration, Rocket Lab engineers will complete inspections and functional tests in the Astrotech cleanroom.Launch is scheduled to occur no earlier than this fall on Blue Origin’s New Glenn rocket.The ESCAPADE mission is funded by NASA’s Heliophysics Division and is part of the NASA Small Innovative Missions for Planetary Exploration program. The mission is led by the University of California, Berkeley’s Space Sciences Laboratory, with key partners including Rocket Lab; NASA’s Goddard Space Flight Center in Greenbelt, Maryland; Embry Riddle Aeronautical University; and Advanced Space LLC. NASA’s Launch Services Program, based at Kennedy Space Center, secured the launch service with Blue Origin under the VADR (Venture-class Acquisition of Dedicated and Rideshare) contract.By Vanessa ThomasNASA’s Goddard Space Flight Center, Greenbelt, Md.Vanessa ThomasSeptember 22, 2025CategoriesEscaPADE (Escape and Plasma Acceleration and Dynamics Explorers)Goddard Space Flight CenterHeliophysicsHeliophysics DivisionMarsSolar WindSpace WeatherThe SunMore from ESCAPADE (Escape and Plasma Acceleration and Dynamics Explorers)Previous PostNASA Stands Down from October Launch for ESCAPADE to MarsSeptember 6, 2024"
  },
  {
    "id": 2,
    "text": "NASA’s twin ESCAPADE (Escape and Plasma Acceleration and Dynamics Explorers) spacecraft are back in Florida in preparation for launch this fall."
  },
  {
    "id": 3,
    "text": "The two spacecraft are destined to orbit Mars, where they will study the structure of the Martian magnetic field, how it interacts with space weather, and how this interaction drives the planet’s atmospheric escape. The information gained from the ESCAPADE spacecraft will enable us to better protect future human and robotic missions to the Red Planet."
  },
  {
    "id": 4,
    "text": "NASA’s two ESCAPADE spacecraft appear inside a clean room at the Astrotech Space Operations Facility in Titusville, Florida, in September 2025.Rocket Lab"
  },
  {
    "id": 5,
    "text": "The ESCAPADE spacecraft arrived at the Astrotech Space Operations Facility in Titusville, Florida, on Sept. 16 from Rocket Lab’s Spacecraft Production Complex and headquarters in Long Beach, California, where it was designed, built, and tested."
  },
  {
    "id": 6,
    "text": "The spacecraft werepreviously in Floridain 2024, but had returned to California afterNASA decided to stand downfrom a launch attempt last year."
  },
  {
    "id": 7,
    "text": "Before propellant loading and vehicle integration, Rocket Lab engineers will complete inspections and functional tests in the Astrotech cleanroom."
  },
  {
    "id": 8,
    "text": "Launch is scheduled to occur no earlier than this fall on Blue Origin’s New Glenn rocket."
  },
  {
    "id": 9,
    "text": "The ESCAPADE mission is funded by NASA’s Heliophysics Division and is part of the NASA Small Innovative Missions for Planetary Exploration program. The mission is led by the University of California, Berkeley’s Space Sciences Laboratory, with key partners including Rocket Lab; NASA’s Goddard Space Flight Center in Greenbelt, Maryland; Embry Riddle Aeronautical University; and Advanced Space LLC. NASA’s Launch Services Program, based at Kennedy Space Center, secured the launch service with Blue Origin under the VADR (Venture-class Acquisition of Dedicated and Rideshare) contract."
  },
  {
    "id": 10,
    "text": "By Vanessa ThomasNASA’s Goddard Space Flight Center, Greenbelt, Md."
  },
  {
    "id": 11,
    "text": "NASA explores the unknown in air and space, innovates for the benefit of humanity, and inspires the world through discovery."
  }
]