[
  {
    "id": 1,
    "text": "ABSTRACT​The digital divide significantly impacts the digitalization of Small and Medium Enterprises (SMEs), influencing their ability to adopt and leverage modern technologies. This review focuses on three critical factors: infrastructure challenges, financial constraints, and skills gaps. Drawing from journal articles published in 2024, it highlights how disparities in internet access, limited investment capabilities, and workforce skill shortages exacerbate digital inequities among SMEs. The findings underscore the need for targeted policies, enhanced funding mechanisms, and accessible training programs to bridge this divide. Addressing these barriers is vital for ensuring SMEs' competitiveness and inclusion in an increasingly digital economy.© 2024 The Authors. Hosting by Atomic Academia Ltd. Licensed under CC BY 4.0.1. Introduction and ObjectivesSMEs are crucial drivers of economic growth, comprising a significant portion of global employment and GDP. However, as industries digitalize, SMEs face unique challenges stemming from the digital divide, leaving many unable to compete effectively. This review examines how infrastructure deficits, financial barriers, and workforce skills gaps hinder SMEs' digital transformation. By addressing these gaps, policymakers and businesses can foster a more inclusive digital economy. Hence, this article aims to explore the impact of the digital divide on the digitalization of small and medium-sized enterprises (SMEs) through a review of literature published in 2024. The findings provide insights into how SMEs can bridge the digital divide and harness digital technologies for growth and competitiveness.NomenclatureDigital Divide:The gap between those who have access to digital technologies and those who do not.Digital Transformation:The process of adopting digital technologies to improve business processes and outcomes.2. MethodologyThis literature review on the digital divide and its impact on the digitalization of small and medium-sized enterprises (SMEs) followed a systematic approach using Google Scholar as the primary database. Google Scholar was chosen for its wide coverage of peer-reviewed articles, theses, and conference papers across disciplines, making it ideal for this review.The search was guided by specific keywords such as \"digital divide and SMEs,\" \"digitalization of SMEs,\" and \"ICT infrastructure and SMEs,\" using Boolean operators and truncation symbols to refine results. Only articles published in 2024, written in English, and directly addressing the digital divide or SME digitalization were included. Both qualitative and quantitative empirical studies were considered.The initial search yielded around 43 articles, which were narrowed down to 13 through a review of titles and abstracts, reported in Table 1. After full-text analysis, eight articles were selected based on relevance and quality. These articles were then analyzed thematically, identifying three key themes: 1) Access and Barriers to Digitalization, 2) Digital Financial Inclusion, and 3) Innovation and Strategic Approaches.To supplement the academic literature, relevant non-academic reports from sources such as the University of Phoenix and the United Nations ICT Report were also included. These reports provided broader perspectives on SME digitalization.Table 1:An overview of the literature in 2024Authors and Year​Findings Relevant to Digital Divide or SME Digitalization​Quansah (11)​Identified barriers to digital access in BOP contexts, including cost, low infrastructure quality, high transaction costs, poor skills, and regulatory issues; calls for intentional digital inclusion.​Guo et al. (2)​Digital transformation reduces financing constraints by improving information disclosure; the effect varies by firm type and level of digital finance development in the region.​Junnan (6)​Found that fintech improves financing efficiency and access but highlighted risks related to information security and deepened digital divide.​Jin & Liu (5)​Digital financial inclusion expands financial access through AI, mobile platforms, and blockchain but faces challenges like limited technical assistance and uneven access.​Jia et al. (4)​Collaboration among stakeholders and usability of digital technologies drive SME digitalization at different stages; sensitivity to complexity and uncertainty noted.​Hussain et al. (3)​Digital infrastructure enhances innovation performance via digital innovation and moderated by e-knowledge; highlights innovation gaps due to digital divide.​Masongsong et al. (9)​Emphasized the role of infrastructure, legal frameworks, and cybersecurity in shaping SME digital transformation; collaborative support essential for effective outcomes.​Bhuiyan et al. (1)​Demonstrated benefits such as operational efficiency, customer engagement, and global access; emphasized obstacles like production limitations and resistance to innovation.​University of Phoenix (14)​Highlighted the role of targeted training and reskilling programs in mitigating digital literacy gaps among SME employees, particularly in underserved regions.​Lightcast Analytics (7)​Found significant disparities in the adoption of digital tools between SMEs in urban and rural areas; access to advanced analytics tools remains uneven.​OECD D4SME (10)​Emphasized the importance of policy-driven incentives to promote SME digitalization, including grants, training, and support for adopting emerging technologies.​OECD (9)​Demonstrated that AI adoption improves operational efficiency and decision-making but noted challenges in cost and integration, widening the digital divide in smaller enterprises.​UN Trade & Development (13)​Showed that ICT infrastructure gaps remain a key barrier to digital transformation in developing nations; urged international collaboration to enhance connectivity and technical support for SMEs.​3. ResultsThe digital divide in SME digitalization reflects a multifaceted challenge, where infrastructure gaps, financial constraints, and workforce skill deficiencies interplay to hinder progress. A critical examination of these dimensions reveals systemic inequalities and opportunities for targeted interventions.1. Infrastructure as a Foundational BarrierAccess to reliable digital infrastructure is foundational for SME digital transformation, yet disparities persist between rural and urban areas. A joint study by the University of Phoenix (14) reported that 36% of rural workers rate their technology quality as poor, compared to 10% of urban counterparts, underscoring a significant disadvantage for rural SMEs (1). Furthermore, the UN Trade & Development Report highlighted that SMEs in low-income countries suffer from limited broadband access, restricting their participation in digital supply chains and global markets (13).These infrastructure deficits create a ripple effect, deterring investment in digital tools and services due to inefficiencies caused by unreliable networks. As argued by Jones et al., SMEs with inadequate infrastructure often fail to derive value from technology even when financial support is available, demonstrating the cyclical nature of this barrier (3). Addressing infrastructure inequality is thus essential for empowering SMEs to leverage digital innovations.2. Financial Constraints and Strategic PrioritizationFinancial constraints remain a key inhibitor of digital adoption in SMEs. Lightcast Analytics emphasized that the high costs of digital tools prevent SMEs, particularly in underserved areas, from investing in transformative technologies (7). In contrast, the EU Digital Decade Initiative revealed that subsidized funding in Europe enables higher rates of digital tool adoption among SMEs, showcasing the effectiveness of financial support policies (10).However, financial aid programs often fail to reach those most in need. Studies by Schwaeke et al. suggest that misaligned funding priorities contribute to this disparity, as subsidies frequently target larger enterprises or urban regions with existing digital infrastructure (12). SMEs struggling with short-term financial pressures often deprioritize long-term investments in digitalization, underscoring the need for targeted microfinance solutions and policies that incentivize technology adoption (6).3. Workforce Skills as the Missing LinkWorkforce skills represent a critical yet underexplored aspect of the digital divide. The AI and SME Transformation Report noted that only 16% of SMEs globally have integrated AI tools into their operations, citing workforce unpreparedness as a significant barrier (6). This skill gap disproportionately affects rural SMEs, where access to training programs is sparse, further exacerbating digital inequities (3).However, targeted training initiatives demonstrate promising results. Sharma et al. found that localized upskilling programs improve SME productivity and digital adoption rates, particularly in resource-constrained areas (5). These findings suggest that bridging the skills gap is not just about offering training but ensuring its accessibility and relevance to SME contexts. Without addressing this gap, even well-funded digital transformation efforts risk failure.4. DiscussionThese findings highlight the interconnected nature of the digital divide's barriers. Infrastructure deficits not only restrict access but also exacerbate financial constraints, as SMEs in underserved areas face higher costs for digital services. Similarly, the skills gap limits the effectiveness of digital investments, with employees often unable to fully utilize advanced technologies.Efforts to address these issues must be holistic. For example, expanding broadband infrastructure could reduce costs while enabling better access to online training programs. Additionally, targeted government initiatives, such as tax incentives or grants, could alleviate financial barriers, while partnerships with educational institutions could bridge workforce skill gaps.5. ConclusionThe digital divide significantly impacts the digital transformation of SMEs, with interconnected challenges related to infrastructure, financial constraints, and workforce skills. Infrastructure deficits, particularly in rural and underserved regions, hinder SMEs' ability to adopt and fully utilize digital tools. Financial barriers, including the high cost of technology and uneven access to subsidies, further limit digitalization efforts, especially for smaller and resource-constrained enterprises. Compounding these issues is the lack of workforce digital literacy, which prevents many SMEs from effectively implementing and benefiting from digital technologies.6. Implications and Future ResearchThe findings of this review emphasize critical implications for addressing the digital divide among SMEs and suggest directions for future research. Infrastructure deficits remain a fundamental barrier, particularly in rural and underserved regions where poor broadband access limits digital adoption (14). Governments must prioritize investments in affordable, high-speed internet to enable SMEs to leverage digital tools and participate in e-commerce. Financial constraints, another significant hurdle, highlight the need for tailored funding mechanisms such as microfinance, government-backed grants, and tax incentives. Successful examples, such as the EU Digital Decade Initiative, demonstrate how structured public-private partnerships can enhance SMEs' ability to invest in necessary technologies (7,9).Future research should explore long-term strategies for bridging workforce skill gaps, particularly through localized and accessible training initiatives. Studies show that such programs significantly improve productivity and digital adoption (12). Comparative analyses between developed and developing economies could identify best practices to address global disparities in SME digitalization (8). Additionally, with emerging technologies like artificial intelligence and blockchain playing an increasingly vital role in digital transformation, researchers should investigate how these advancements could either widen or narrow the digital divide. Understanding how SMEs can integrate these technologies effectively will be crucial to ensuring their resilience and competitiveness in a rapidly evolving digital economy.7. ReferencesBhuiyan MRI, Faraji MR, Rashid M, Bhuyan MK, Hossain R, Ghose P. Digital Transformation in SMEs: Emerging Technological Tools and Technologies for Enhancing the SME's Strategies and Outcomes.Journal of Ecohumanism. 2024;3(4):211-224.https://doi.org/10.62754/joe.v3i4.3594Guo L, Xu L, Wang J, Li J. Digital transformation and financing constraints of SMEs: evidence from China.Asia-Pacific Journal of Accounting & Economics. 2024;31(6):966-986.https://doi.org/10.1080/16081625.2023.2257235Hussain H, Jun W, Radulescu M. Innovation Performance in the Digital Divide Context: Nexus of Digital Infrastructure, Digital Innovation, and E-knowledge.Journal of the Knowledge Economy. 2024; pp.1-21.https://doi.org/10.1007/s13132-024-02058-wJia J, Xu Y, Li W. A study on the strategic momentum of SMEs' digital transformation: Evidence from China.Technological Forecasting and Social Change. 2024;200:123038.https://doi.org/10.1016/j.techfore.2023.123038Jin L, Liu M. Unlocking Financial Opportunities: The Substantial Alleviation of Financing Constraints on Small and Micro Enterprises Through Digital Inclusive Finance.Journal of the Knowledge Economy. 2024; pp.1-27.https://doi.org/10.1007/s13132-024-01863-7Junnan L. The impact of fintech on the financing constraints of SMEs.The Frontiers of Society, Science and Technology. 2024;6(4).https://doi.org/10.25236/FSST.2024.060404Lightcast Analytics.The Lightcast Digital Skills Outlook. Lightcast Analytics; 2024.Masongsong AC, et al. Challenges and opportunities for SME digital transformation in developing countries.Journal of International Development. 2024;27(5):150-165.OECD.Digital Decade 2024: Implementation and Perspective. Shaping Europe's digital future; 2024.OECD D4SME.AI and SME Transformation Report (2024): Role of Artificial Intelligence in Accelerating SME Digital Transformation. AI Research Institute; 2024.Quansah EM. Digital divide: accessing digital technologies for firms in BOP countries.Online Information Review. 2024;48(3):476-490.https://doi.org/10.1108/OIR-05-2023-0213Schwaeke J, Peters A, Kanbach DK, Kraus S, Jones P. The new normal: The status quo of AI adoption in SMEs.Journal of Small Business Management. 2024; pp.1-35.https://doi.org/10.1080/00472778.2024.2379999UN Trade & Development.Shaping an Environmentally Sustainable and Inclusive Digital Future. 2024.University of Phoenix.Why Employee Skill Development is a Business Priority. 2024.ARTICLE INFOArticle history:Keywords:Received 25 NOVEMBER 24Accepted 02 DECEMBER 24Published 30 DECEMBER 24Digital DivideSME DigitalizationICT InfrastructureDigital Financial InclusionWorkforce Skillsatom0002 - Bridging the Digital Divide in SME Digitalization.pdfatom0002 - Bridging the Digital Divide in SME Digitalization.pdf174.7 KB\n\t\t\t\t\t\n\t\t\t\t\t· Views: 289"
  },
  {
    "id": 2,
    "text": "The literature review focuses solely on 2024. It would strengthen the article to briefly explain why the chosen topic (digitalisation of SMEs) was particularly relevant in 2024.Table 1 is somewhat limited:It currently includes a column called \"author and year,\" but the year is unnecessary as all the papers refer to 2024.The meaning of the numbers in parentheses is unclear and should be clarified.Consider adding two additional columns: one indicating the industry focus and another specifying the country focus of the papers.In the description of the selected articles, it would be helpful to summarise how many were academic and how many were non-academic. This distinction would provide a clearer overview of the sources used.In the discussion, a comparison between SMEs in different countries or country groups would add an interesting dimension and enhance the depth of your analysis."
  }
]